
'''
让n个人围成一圈，从1开始按顺序编号，从第一个人开始从1到k（k设为3）报数
报到3的人就退出，然后圈子缩小，从下一个人继续游戏，最后留下的人幸存
请问最后留下的是第几号
'''
if __name__ == "__main__":
    def wodi(lst,k):
        t_lst = lst[:]
        while len(t_lst)>1:
            print(t_lst)
            for i in range(k-1):
                t_lst.append(t_lst.pop(0))
            t_lst.pop(0)
        return t_lst
lst=list(range(1,11))
print(wodi(lst,3))
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# [4, 5, 6, 7, 8, 9, 10, 1, 2]
# [7, 8, 9, 10, 1, 2, 4, 5]
# [10, 1, 2, 4, 5, 7, 8]
# [4, 5, 7, 8, 10, 1]
# [8, 10, 1, 4, 5]
# [4, 5, 8, 10]
# [10, 4, 5]
# [10, 4]
# [4]